results/runs/ycsb/2026-05-17T09-52-01/mongodb/load_workload_d.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
Command line: -load -db site.ycsb.db.MongoDbClient -s -P workloads/workloada -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p threadcount=10 -p mongodb.upsert=true -p core_workload_insertion_retry_limit=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-05-17 09:50:56:744 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-05-17 09:51:03:857 7 sec: 100000 operations; 13972.33 current ops/sec; [CLEANUP: Count=10, Max=7735, Min=2, Avg=781.5, 90=32, 99=7735, 99.9=7735, 99.99=7735] [INSERT: Count=100000, Max=321023, Min=237, Avg=657.51, 90=999, 99=3915, 99.9=11063, 99.99=35263] 
[OVERALL], RunTime(ms), 7157
[OVERALL], Throughput(ops/sec), 13972.334777141261
[TOTAL_GCS_G1_Young_Generation], Count, 19
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 114
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 1.5928461645941039
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 19
[TOTAL_GC_TIME], Time(ms), 114
[TOTAL_GC_TIME_%], Time(%), 1.5928461645941039
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 781.5
[CLEANUP], MinLatency(us), 2
[CLEANUP], MaxLatency(us), 7735
[CLEANUP], 95thPercentileLatency(us), 7735
[CLEANUP], 99thPercentileLatency(us), 7735
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 657.51409
[INSERT], MinLatency(us), 237
[INSERT], MaxLatency(us), 321023
[INSERT], 95thPercentileLatency(us), 1509
[INSERT], 99thPercentileLatency(us), 3915
[INSERT], Return=OK, 100000